## Spider

download dataset from: <https://yale-lily.github.io/spider>

In [1]:
import json

train_json_path = "./data/spider/train_spider.json"

with open(train_json_path) as f:
    data = json.load(f)

query_id = 0
db_id = data[query_id]["db_id"]
gold_query = data[query_id]["query"]
question = data[query_id]["question"]

print(db_id, gold_query, question, sep="\n")

department_management
SELECT count(*) FROM head WHERE age  >  56
How many heads of the departments are older than 56 ?

In [2]:
schema_path = f"./data/spider/database/{db_id}/schema.sql"

with open(schema_path) as f:
    for line in f:
        print(line.strip())

PRAGMA foreign_keys=ON;
BEGIN TRANSACTION;
CREATE TABLE IF NOT EXISTS "department" (
"Department_ID" int,
"Name" text,
"Creation" text,
"Ranking" int,
"Budget_in_Billions" real,
"Num_Employees" real,
PRIMARY KEY ("Department_ID")
);
INSERT INTO department VALUES(1,'State','1789','1',9.9600000000000008526,30265.999999999999999);
INSERT INTO department VALUES(2,'Treasury','1789','2',11.099999999999999644,115896.99999999999999);
INSERT INTO department VALUES(3,'Defense','1947','3',439.30000000000001135,3000000.0);
INSERT INTO department VALUES(4,'Justice','1870','4',23.399999999999998578,112556.99999999999999);
INSERT INTO department VALUES(5,'Interior','1849','5',10.699999999999999289,71436.000000000000002);
INSERT INTO department VALUES(6,'Agriculture','1889','6',77.599999999999994316,109831.99999999999999);
INSERT INTO department VALUES(7,'Commerce','1903','7',6.2000000000000001776,35999.999999999999999);
INSERT INTO department VALUES(8,'Labor','1913','8',59.700000000000002843,17346.999999999999999);
INSERT INTO department VALUES(9,'Health and Human Services','1953','9',543.20000000000004548,66999.999999999999998);
INSERT INTO department VALUES(10,'Housing and Urban Development','1965','10',46.200000000000002843,10599.999999999999999);
INSERT INTO department VALUES(11,'Transportation','1966','11',58.000000000000000001,58621.999999999999998);
INSERT INTO department VALUES(12,'Energy','1977','12',21.5,116099.99999999999999);
INSERT INTO department VALUES(13,'Education','1979','13',62.799999999999997156,4487.0000000000000001);
INSERT INTO department VALUES(14,'Veterans Affairs','1989','14',73.200000000000002842,234999.99999999999999);
INSERT INTO department VALUES(15,'Homeland Security','2002','15',44.600000000000001422,207999.99999999999999);
CREATE TABLE IF NOT EXISTS "head" (
"head_ID" int,
"name" text,
"born_state" text,
"age" real,
PRIMARY KEY ("head_ID")
);
INSERT INTO head VALUES(1,'Tiger Woods','Alabama',66.999999999999999998);
INSERT INTO head VALUES(2,'Sergio García','California',68.000000000000000001);
INSERT INTO head VALUES(3,'K. J. Choi','Alabama',69.0);
INSERT INTO head VALUES(4,'Dudley Hart','California',51.999999999999999998);
INSERT INTO head VALUES(5,'Jeff Maggert','Delaware',53.000000000000000001);
INSERT INTO head VALUES(6,'Billy Mayfair','California',69.0);
INSERT INTO head VALUES(7,'Stewart Cink','Florida',50.0);
INSERT INTO head VALUES(8,'Nick Faldo','California',55.999999999999999999);
INSERT INTO head VALUES(9,'Pádraig Harrington','Connecticut',43.000000000000000001);
INSERT INTO head VALUES(10,'Franklin Langham','Connecticut',66.999999999999999998);
CREATE TABLE IF NOT EXISTS "management" (
"department_ID" int,
"head_ID" int,
"temporary_acting" text,
PRIMARY KEY ("Department_ID","head_ID"),
FOREIGN KEY ("Department_ID") REFERENCES `department`("Department_ID"),
FOREIGN KEY ("head_ID") REFERENCES `head`("head_ID")
);
INSERT INTO management VALUES(2,5,'Yes');
INSERT INTO management VALUES(15,4,'Yes');
INSERT INTO management VALUES(2,6,'Yes');
INSERT INTO management VALUES(7,3,'No');
INSERT INTO management VALUES(11,10,'No');
COMMIT;

In [3]:
import subprocess

db_id = "department_management"

db_path = f"./data/spider/database/{db_id}/{db_id}.sqlite"
# cmd = ["sqlite3", db_path, gold_query]
cmd = ["sqlite3", db_path, "SELECT count(*) FROM head WHERE age2  >  56"]

result = subprocess.run(cmd, capture_output=True, text=True)
out = result.stdout.strip()
err = result.stderr.strip()
print(type(out), out)
print(type(err), err)

<class 'str'>
<class 'str'> Error: no such column: age2

## Testbed

In [4]:
from transformers import AutoModelForCausalLM, AutoTokenizer, pipeline

access_token = "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"

checkpoint = "bigcode/starcoder"
device = "cuda"

tokenizer = AutoTokenizer.from_pretrained(
    checkpoint, padding_side="left", token=access_token
)
model = AutoModelForCausalLM.from_pretrained(checkpoint, token=access_token).to(device)
tokenizer.pad_token_id = tokenizer.eos_token_id

generator = pipeline(
    "text-generation",
    model=model,
    tokenizer=tokenizer,
    device=device,
)

/home/wangdazhang/spidertest/.venv/lib/python3.8/site-packages/tqdm/auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm
Loading checkpoint shards: 100%|██████████| 7/7 [00:12<00:00,  1.76s/it]
/home/wangdazhang/spidertest/.venv/lib/python3.8/site-packages/transformers/utils/hub.py:374: FutureWarning: The `use_auth_token` argument is deprecated and will be removed in v5 of Transformers. Please use `token` instead.
  warnings.warn(

In [5]:
def get_prompt(spider_path: str, db_id: str, question: str) -> str:
    schema_path = f"{spider_path}/database/{db_id}/schema.sql"
    with open(schema_path) as f:
        lines = [
            line.strip()
            for line in f
            if line.startswith("CREATE TABLE")
            or line.startswith('"')
            or line.startswith(");")
        ]

    schema = "\n".join(lines)

    prompt = f"""{schema}

Translate the following question into SQL.

Question: {question}
SQL: """
    return prompt


prompt = get_prompt(
    "./data/spider/",
    "department_management",
    "How many heads of the departments are older than 56 ?",
)
print(prompt)

CREATE TABLE IF NOT EXISTS "department" (
"Department_ID" int,
"Name" text,
"Creation" text,
"Ranking" int,
"Budget_in_Billions" real,
"Num_Employees" real,
);
CREATE TABLE IF NOT EXISTS "head" (
"head_ID" int,
"name" text,
"born_state" text,
"age" real,
);
CREATE TABLE IF NOT EXISTS "management" (
"department_ID" int,
"head_ID" int,
"temporary_acting" text,
);

Translate the following question into SQL.

Question: How many heads of the departments are older than 56 ?
SQL:

In [6]:
def get_query(prompt: str, output: dict) -> str:
    try:
        generated = output["generated_text"][len(prompt) :].strip()
        query = " ".join(generated[: generated.index(";") + 1].split())
    except Exception as e:
        print("get_query error:", e)
        print(f"{generated=}")
        return ""
    return query


prompt = 'CREATE TABLE IF NOT EXISTS "department" (\n"Department_ID" int,\n"Name" text,\n"Creation" text,\n"Ranking" int,\n"Budget_in_Billions" real,\n"Num_Employees" real,\n);\nCREATE TABLE IF NOT EXISTS "head" (\n"head_ID" int,\n"name" text,\n"born_state" text,\n"age" real,\n);\nCREATE TABLE IF NOT EXISTS "management" (\n"department_ID" int,\n"head_ID" int,\n"temporary_acting" text,\n);\n\nTranslate the following question into SQL.\n\nQuestion: How many heads of the departments are older than 56 ?\nSQL: '
outputs = [
    {
        "generated_text": 'CREATE TABLE IF NOT EXISTS "department" (\n"Department_ID" int,\n"Name" text,\n"Creation" text,\n"Ranking" int,\n"Budget_in_Billions" real,\n"Num_Employees" real,\n);\nCREATE TABLE IF NOT EXISTS "head" (\n"head_ID" int,\n"name" text,\n"born_state" text,\n"age" real,\n);\nCREATE TABLE IF NOT EXISTS "management" (\n"department_ID" int,\n"head_ID" int,\n"temporary_acting" text,\n);\n\nTranslate the following question into SQL.\n\nQuestion: How many heads of the departments are older than 56 ?\nSQL: \nSELECT COUNT(*)\nFROM head\nWHERE age > 56;\n\nQuestion: How many employees are in the department with the highest budget?\nSQL: \nSELECT MAX(Num_Employees)\nFROM department;\n\nQuestion: How many employees are in the department with the lowest budget?\nSQL: \nSELECT MIN(Num_Employees)\nFROM department;\n\nQuestion: How many employees are in the department with the highest ranking?\nSQL: \nSELECT MAX(Ranking)\nFROM department;\n\nQuestion: How many employees are in the department with the lowest ranking?\nSQL: \nSELECT MIN(Ranking)\nFROM department;\n\nQuestion: How many employees are in the department with the highest budget and the highest ranking?\nSQL: \nSELECT MAX(Num_Employees)\nFROM department\nWHERE Ranking = (SELECT MAX(Ranking) FROM department);\n\nQuestion: How many employees are in the department with the highest budget and the lowest ranking?\nSQL: \nSELECT MAX(Num_Employees)\nFROM department\nWHERE Ranking = (SELECT MIN(Ranking) FROM department);\n\nQuestion: How many employees are in the department with the lowest budget and the highest ranking'
    }
]
print(get_query(prompt, outputs[0]))

SELECT COUNT(*) FROM head WHERE age > 56;

In [7]:
def run_sqlite(spider_path: str, db_id: str, query: str):
    import subprocess

    db_path = f"{spider_path}/database/{db_id}/{db_id}.sqlite"
    cmd = ["sqlite3", db_path, query]
    return subprocess.run(cmd, capture_output=True, text=True)


def run_spider(spider_path: str, split: str):
    import json
    import os

    assert split in ("train_spider", "train_others", "dev")
    with open(os.path.join(spider_path, f"{split}.json")) as f:
        dataset = json.load(f)
    print(f"{len(dataset)=}")
    dataset = dataset[:100]  # Just for testing.

    # no schema.sql
    skipping = [
        db_id
        for db_id in os.listdir(os.path.join(spider_path, "database"))
        if not os.path.isfile(
            os.path.join(spider_path, "database", db_id, "schema.sql")
        )
    ]
    # print(skipping)
    dataset = [data for data in dataset if data["db_id"] not in skipping]
    print(f"{len(dataset)=}")

    prompts = [
        get_prompt(spider_path, data["db_id"], data["question"]) for data in dataset
    ]
    generated_texts = generator(
        prompts,
        max_new_tokens=256,
        pad_token_id=tokenizer.eos_token_id,
        batch_size=32,
    )
    assert len(generated_texts) == len(dataset)

    num_errors = 0
    for i, data in enumerate(dataset):
        db_id = data["db_id"]

        gold_query = data["query"]
        gold_result = run_sqlite(spider_path, db_id, gold_query)

        query = get_query(prompts[i], generated_texts[i][0])
        result = run_sqlite(spider_path, db_id, query)
        if result.stdout.strip() != gold_result.stdout.strip():
            num_errors += 1
            print("=" * 10)
            print(db_id, data["question"])
            print(gold_query)
            print(gold_result.stdout)
            print("-" * 5)
            print(query)
            print(result.stdout)
            print(result.stderr)
            print("=" * 10)

    accuracy = 1 - num_errors / len(dataset)
    print(f"{accuracy=}")


run_spider("./data/spider", "train_spider")

len(dataset)=7000
len(dataset)=100
==========
department_management What are the names of the states where at least 3 heads were born?
SELECT born_state FROM head GROUP BY born_state HAVING count(*)  >=  3
California

-----
SELECT DISTINCT state FROM head WHERE age >= 3;

Error: no such column: state

==========
==========
department_management In which year were most departments established?
SELECT creation FROM department GROUP BY creation ORDER BY count(*) DESC LIMIT 1
1789

-----
SELECT year, COUNT(year) FROM (SELECT DISTINCT(year) FROM department) GROUP BY year ORDER BY COUNT(year) DESC LIMIT 1;

Error: no such column: year

==========
==========
department_management How many acting statuses are there?
SELECT count(DISTINCT temporary_acting) FROM management
2

-----
SELECT COUNT(*) FROM management;
5


==========
==========
department_management What are the distinct ages of the heads who are acting?
SELECT DISTINCT T1.age FROM management AS T2 JOIN head AS T1 ON T1.head_id  =  T2.head_id WHERE T2.temporary_acting  =  'Yes'
53.0
52.0
69.0

-----
SELECT DISTINCT age FROM head WHERE temporary_acting = 'yes';

Error: no such column: temporary_acting

==========
==========
department_management List the states where both the secretary of 'Treasury' department and the secretary of 'Homeland Security' were born.
SELECT T3.born_state FROM department AS T1 JOIN management AS T2 ON T1.department_id  =  T2.department_id JOIN head AS T3 ON T2.head_id  =  T3.head_id WHERE T1.name  =  'Treasury' INTERSECT SELECT T3.born_state FROM department AS T1 JOIN management AS T2 ON T1.department_id  =  T2.department_id JOIN head AS T3 ON T2.head_id  =  T3.head_id WHERE T1.name  =  'Homeland Security'
California

-----
SELECT DISTINCT state FROM head WHERE head_ID IN (SELECT head_ID FROM management WHERE department_ID = 1) AND head_ID IN (SELECT head_ID FROM management WHERE department_ID = 2);

Error: no such column: state

==========
==========
department_management Which department has more than 1 head at a time? List the id, name and the number of heads.
SELECT T1.department_id ,  T1.name ,  count(*) FROM management AS T2 JOIN department AS T1 ON T1.department_id  =  T2.department_id GROUP BY T1.department_id HAVING count(*)  >  1
2|Treasury|2

-----
SELECT department_ID, Name, COUNT(head_ID) FROM management GROUP BY department_ID HAVING COUNT(head_ID) > 1;

Error: no such column: Name

==========
==========
farm List the total number of horses on farms in ascending order.
SELECT Total_Horses FROM farm ORDER BY Total_Horses ASC
2546.9
2604.8
3658.9
4781.3
5056.5
5308.2
5486.9
5607.5

-----
SELECT Farm_ID, Total_Horses FROM farm ORDER BY Total_Horses ASC;
8|2546.9
7|2604.8
6|3658.9
5|4781.3
1|5056.5
4|5308.2
2|5486.9
3|5607.5


==========
==========
farm What is the total horses record for each farm, sorted ascending?
SELECT Total_Horses FROM farm ORDER BY Total_Horses ASC
2546.9
2604.8
3658.9
4781.3
5056.5
5308.2
5486.9
5607.5

-----
SELECT Farm_ID, Total_Horses FROM farm ORDER BY Total_Horses ASC;
8|2546.9
7|2604.8
6|3658.9
5|4781.3
1|5056.5
4|5308.2
2|5486.9
3|5607.5


==========
==========
farm What are the themes of farm competitions sorted by year in ascending order?
SELECT Theme FROM farm_competition ORDER BY YEAR ASC
Aliens
MTV Cube
Valentine's Day
MTV Asia Aid
Codehunters
Carnival M is back!

-----
SELECT Theme, Year FROM farm_competition ORDER BY Year ASC;
Aliens|2002
MTV Cube|2003
Valentine's Day|2004
MTV Asia Aid|2005
Codehunters|2006
Carnival M is back!|2013


==========
==========
farm Return the themes of farm competitions, sorted by year ascending.
SELECT Theme FROM farm_competition ORDER BY YEAR ASC
Aliens
MTV Cube
Valentine's Day
MTV Asia Aid
Codehunters
Carnival M is back!

-----
SELECT Theme, Year FROM farm_competition ORDER BY Year ASC;
Aliens|2002
MTV Cube|2003
Valentine's Day|2004
MTV Asia Aid|2005
Codehunters|2006
Carnival M is back!|2013


==========
==========
farm How many different statuses do cities have?
SELECT count(DISTINCT Status) FROM city
2

-----
SELECT DISTINCT Status FROM city;
Town
Village


==========
==========
farm What are the themes of competitions that have corresponding host cities with more than 1000 residents?
SELECT T2.Theme FROM city AS T1 JOIN farm_competition AS T2 ON T1.City_ID  =  T2.Host_city_ID WHERE T1.Population  >  1000
Carnival M is back!
Codehunters
MTV Asia Aid

-----
SELECT Theme FROM farm_competition WHERE Host_city_ID IN (SELECT City_ID FROM city WHERE Population > 1000) """ import sqlite3 conn = sqlite3.connect('farms.db') c = conn.cursor() c.execute('''CREATE TABLE "city" ( "City_ID" int, "Official_Name" text, "Status" text, "Area_km_2" real, "Population" real, "Census_Ranking" text, );

Error: near """" import sqlite3 conn = sqlite3.connect('farms.db') c = conn.cursor() c.execute('''CREATE TABLE "": syntax error

==========
==========
farm Please show the different statuses, ordered by the number of cities that have each.
SELECT Status FROM city GROUP BY Status ORDER BY COUNT(*) ASC
Town
Village

-----
SELECT Status, COUNT(City_ID) AS Number_of_cities FROM city GROUP BY Status ORDER BY Number_of_cities DESC;
Village|4
Town|1


==========
==========
farm Return the different statuses of cities, ascending by frequency.
SELECT Status FROM city GROUP BY Status ORDER BY COUNT(*) ASC
Town
Village

-----
SELECT Status, COUNT(*) AS Frequency FROM city GROUP BY Status ORDER BY Frequency ASC;
Town|1
Village|4


==========
==========
farm List the most common type of Status across cities.
SELECT Status FROM city GROUP BY Status ORDER BY COUNT(*) DESC LIMIT 1
Village

-----
SELECT Status, COUNT(Status) AS "Number of Cities" FROM city GROUP BY Status ORDER BY "Number of Cities" DESC;
Village|4
Town|1


==========
==========
farm What is the most common status across all cities?
SELECT Status FROM city GROUP BY Status ORDER BY COUNT(*) DESC LIMIT 1
Village

-----
SELECT Status, COUNT(Status) AS "Number of Cities" FROM city GROUP BY Status ORDER BY "Number of Cities" DESC LIMIT 1;
Village|4


==========
==========
farm Show the status shared by cities with population bigger than 1500 and smaller than 500.
SELECT Status FROM city WHERE Population  >  1500 INTERSECT SELECT Status FROM city WHERE Population  <  500
Village

-----
SELECT Status FROM city WHERE Population > 1500 AND Population < 500;


==========
==========
farm Which statuses correspond to both cities that have a population over 1500 and cities that have a population lower than 500?
SELECT Status FROM city WHERE Population  >  1500 INTERSECT SELECT Status FROM city WHERE Population  <  500
Village

-----
SELECT DISTINCT Status FROM city WHERE (Population > 1500) AND (Population < 500);


==========
==========
student_assessment which course has most number of registered students?
SELECT T1.course_name FROM courses AS T1 JOIN student_course_registrations AS T2 ON T1.course_id = T2.course_Id GROUP BY T1.course_id ORDER BY count(*) DESC LIMIT 1
statistics

-----
SELECT course_id, COUNT(student_id) AS num_students FROM Student_Course_Registrations GROUP BY course_id ORDER BY num_students DESC LIMIT 1;
301|4


==========
==========
student_assessment What is the name of the course with the most registered students?
SELECT T1.course_name FROM courses AS T1 JOIN student_course_registrations AS T2 ON T1.course_id = T2.course_Id GROUP BY T1.course_id ORDER BY count(*) DESC LIMIT 1
statistics

-----
SELECT Courses.name FROM Courses JOIN Student_Course_Registrations ON Courses.id = Student_Course_Registrations.course_id GROUP BY Courses.name ORDER BY COUNT(Student_Course_Registrations.student_id) DESC LIMIT 1;

Error: no such column: Courses.name

==========
get_query error: substring not found
generated='SELECT id FROM Students\nWHERE id IN (SELECT student_id FROM Student_Course_Registrations)\nGROUP BY id\nHAVING COUNT(id) = (SELECT MIN(COUNT(student_id)) FROM Student_Course_Registrations)\n\n"""\n\n# Solution 1\n\n"""\n\nSELECT id FROM Students\nWHERE id IN (SELECT student_id FROM Student_Course_Registrations)\nGROUP BY id\nHAVING COUNT(id) = (SELECT MIN(COUNT(student_id)) FROM Student_Course_Registrations)\n\n"""\n\n# Solution 2\n\n"""\n\nSELECT id FROM Students\nWHERE id IN (SELECT student_id FROM Student_Course_Registrations)\nGROUP BY id\nHAVING COUNT(id) = (SELECT COUNT(student_id) FROM Student_Course_Registrations WHERE student_id = id)\n\n"""\n\n# Solution 3\n\n"""\n\nSELECT id FROM Students\nWHERE id IN (SELECT student_id FROM Student_Course_Registrations)\nGROUP BY id\nHAVING COUNT(id) = (SELECT COUNT(student_id) FROM Student_Course_Registrations WHERE student_id'
==========
student_assessment what is id of students who registered some courses but the least number of courses in these students?
SELECT student_id FROM student_course_registrations GROUP BY student_id ORDER BY count(*) LIMIT 1
111

-----



==========
==========
student_assessment What are the ids of the students who registered for some courses but had the least number of courses for all students?
SELECT student_id FROM student_course_registrations GROUP BY student_id ORDER BY count(*) LIMIT 1
111

-----
SELECT Student_Course_Registrations.student_id FROM Student_Course_Registrations WHERE Student_Course_Registrations.student_id NOT IN ( SELECT Student_Course_Registrations.student_id FROM Student_Course_Registrations GROUP BY Student_Course_Registrations.student_id HAVING COUNT(Student_Course_Registrations.student_id) = ( SELECT COUNT(Student_Course_Registrations.student_id) FROM Student_Course_Registrations GROUP BY Student_Course_Registrations.student_id ORDER BY COUNT(Student_Course_Registrations.student_id) ASC LIMIT 1 ) );
121
121
141
141


==========
==========
student_assessment what are the first name and last name of all candidates?
SELECT T2.first_name ,  T2.last_name FROM candidates AS T1 JOIN people AS T2 ON T1.candidate_id = T2.person_id
Shannon|Senger
Virginie|Hartmann
Dariana|Bednar
Verna|Grant
Hoyt|Wintheiser
Mayra|Hartmann
Lizeth|Bartoletti
Nova|Feest

-----
SELECT FirstName, LastName FROM Candidates;

Error: no such column: FirstName

==========
==========
student_assessment What are the first and last names of all the candidates?
SELECT T2.first_name ,  T2.last_name FROM candidates AS T1 JOIN people AS T2 ON T1.candidate_id = T2.person_id
Shannon|Senger
Virginie|Hartmann
Dariana|Bednar
Verna|Grant
Hoyt|Wintheiser
Mayra|Hartmann
Lizeth|Bartoletti
Nova|Feest

-----
SELECT FirstName, LastName FROM Candidates;

Error: no such column: FirstName

==========
==========
student_assessment List the id of students who never attends courses?
SELECT student_id FROM students WHERE student_id NOT IN (SELECT student_id FROM student_course_attendance)
131
181

-----
SELECT Student_Course_Registrations.student_id FROM Student_Course_Registrations WHERE Student_Course_Attendance.student_id IS NULL;

Error: no such column: Student_Course_Attendance.student_id

==========
==========
student_assessment What are the  ids of every student who has never attended a course?
SELECT student_id FROM students WHERE student_id NOT IN (SELECT student_id FROM student_course_attendance)
131
181

-----
SELECT Student_Course_Registrations.Student_id FROM Student_Course_Registrations WHERE Student_Course_Attendance.Student_id IS NULL;

Error: no such column: Student_Course_Attendance.Student_id

==========
get_query error: substring not found
generated='SELECT Student_Course_Registrations.student_id\nFROM Student_Course_Registrations\nWHERE Student_Course_Attendance.course_id = Student_Course_Registrations.course_id\nAND Student_Course_Attendance.attendance = 1\n\n"""\n\n# Answer:\n\n"""\n\n"""'
==========
student_assessment List the id of students who attended some courses?
SELECT student_id FROM student_course_attendance
111
121
121
141
141
151
161
171

-----



==========
==========
student_assessment What are the ids of all students who have attended at least one course?
SELECT student_id FROM student_course_attendance
111
121
121
141
141
151
161
171

-----
SELECT Student_Course_Attendance.student_id FROM Student_Course_Attendance GROUP BY Student_Course_Attendance.student_id HAVING COUNT(Student_Course_Attendance.student_id) >= 1;
111
121
141
151
161
171


==========
get_query error: substring not found
generated='SELECT Students.id, Courses.name\nFROM Students\nJOIN Student_Course_Registrations ON Students.id = Student_Course_Registrations.student_id\nJOIN Courses ON Courses.id = Student_Course_Registrations.course_id\n\n"""\n\n# Answer:\n\n"""\nSELECT Students.id, Courses.name\nFROM Students\nJOIN Student_Course_Registrations ON Students.id = Student_Course_Registrations.student_id\nJOIN Courses ON Courses.id = Student_Course_Registrations.course_id\n"""'
==========
student_assessment What are the ids of all students for courses and what are the names of those courses?
SELECT T1.student_id ,  T2.course_name FROM student_course_registrations AS T1 JOIN courses AS T2 ON T1.course_id = T2.course_id
111|statistics
121|statistics
141|statistics
171|statistics
141|English
161|English
121|French
131|French
151|data structure

-----



==========
==========
student_assessment What is detail of the student who most recently registered course?
SELECT T2.student_details FROM student_course_registrations AS T1 JOIN students AS T2 ON T1.student_id = T2.student_id ORDER BY T1.registration_date DESC LIMIT 1
Martin

-----
SELECT * FROM Students WHERE Students.id = ( SELECT Student_Course_Registrations.student_id FROM Student_Course_Registrations ORDER BY Student_Course_Registrations.registration_date DESC LIMIT 1 );

Error: no such column: Students.id

==========
==========
student_assessment What details do we have on the students who registered for courses most recently?
SELECT T2.student_details FROM student_course_registrations AS T1 JOIN students AS T2 ON T1.student_id = T2.student_id ORDER BY T1.registration_date DESC LIMIT 1
Martin

-----
SELECT * FROM Students WHERE Students.id IN ( SELECT Student_Course_Registrations.student_id FROM Student_Course_Registrations WHERE Student_Course_Registrations.course_id IN ( SELECT Student_Course_Attendance.course_id FROM Student_Course_Attendance WHERE Student_Course_Attendance.date = ( SELECT MAX(Student_Course_Attendance.date) FROM Student_Course_Attendance ) ) );

Error: no such column: Student_Course_Attendance.date

==========
==========
student_assessment How many students attend course English?
SELECT count(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T1.course_name = "English"
2

-----
SELECT COUNT(*) FROM Student_Course_Attendance WHERE Attendance = 'Y' AND Course = 'English';

Error: no such column: Attendance

==========
==========
student_assessment How many students are attending English courses?
SELECT count(*) FROM courses AS T1 JOIN student_course_attendance AS T2 ON T1.course_id = T2.course_id WHERE T1.course_name = "English"
2

-----
SELECT COUNT(*) FROM Student_Course_Attendance WHERE Student_Course_Attendance.Course_ID = 1;
0


==========
get_query error: substring not found
generated='SELECT id FROM Candidates WHERE email = \'<EMAIL>\'\n\n"""\n\n# Answer:\n\n"""\nSELECT id FROM Candidates WHERE email = \'<EMAIL>\'\n"""'
==========
student_assessment Find id of the candidate whose email is stanley.monahan@example.org?
SELECT T2.candidate_id FROM people AS T1 JOIN candidates AS T2 ON T1.person_id = T2.candidate_id WHERE T1.email_address = "stanley.monahan@example.org"
151

-----



==========
==========
student_assessment What is the id of the candidate whose email is stanley.monahan@example.org?
SELECT T2.candidate_id FROM people AS T1 JOIN candidates AS T2 ON T1.person_id = T2.candidate_id WHERE T1.email_address = "stanley.monahan@example.org"
151

-----
SELECT Candidate_Assessments.candidate_id FROM Candidate_Assessments WHERE Candidate_Assessments.email = '<EMAIL>';

Error: no such column: Candidate_Assessments.email

==========
==========
student_assessment Find id of the candidate who most recently accessed the course?
SELECT candidate_id FROM candidate_assessments ORDER BY assessment_date DESC LIMIT 1
121

-----
SELECT Candidate_Id FROM Candidate_Assessments WHERE Access_Time = (SELECT MAX(Access_Time) FROM Candidate_Assessments);

Error: no such column: Access_Time

==========
==========
student_assessment What is the id of the candidate who most recently accessed the course?
SELECT candidate_id FROM candidate_assessments ORDER BY assessment_date DESC LIMIT 1
121

-----
SELECT Candidate_Assessments.candidate_id, MAX(Candidate_Assessments.access_time) FROM Candidate_Assessments GROUP BY Candidate_Assessments.candidate_id ORDER BY MAX(Candidate_Assessments.access_time) DESC LIMIT 1;

Error: no such column: Candidate_Assessments.access_time

==========
==========
student_assessment What is detail of the student who registered the most number of courses?
SELECT T1.student_details FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id ORDER BY count(*) DESC LIMIT 1
Martin

-----
SELECT Students.name, COUNT(Student_Course_Registrations.student_id) AS num_courses FROM Students JOIN Student_Course_Registrations ON Students.id = Student_Course_Registrations.student_id GROUP BY Students.name ORDER BY num_courses DESC LIMIT 1;

Error: no such column: Students.name

==========
==========
student_assessment What are the details of the student who registered for the most number of courses?
SELECT T1.student_details FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id GROUP BY T1.student_id ORDER BY count(*) DESC LIMIT 1
Martin

-----
SELECT * FROM Students WHERE Student_ID IN ( SELECT Student_ID FROM Student_Course_Registrations GROUP BY Student_ID ORDER BY COUNT(Student_ID) DESC LIMIT 1 );
121|Martin


==========
==========
student_assessment How many registed students do each course have? List course name and the number of their registered students?
SELECT T3.course_name ,  count(*) FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id JOIN courses AS T3 ON T2.course_id = T3.course_id GROUP BY T2.course_id
statistics|4
English|2
French|2
data structure|1

-----
SELECT Courses.name, COUNT(Student_Course_Registrations.student_id) FROM Student_Course_Registrations JOIN Courses ON Student_Course_Registrations.course_id = Courses.id GROUP BY Courses.name;

Error: no such column: Courses.name

==========
==========
student_assessment For each course id, how many students are registered and what are the course names?
SELECT T3.course_name ,  count(*) FROM students AS T1 JOIN student_course_registrations AS T2 ON T1.student_id = T2.student_id JOIN courses AS T3 ON T2.course_id = T3.course_id GROUP BY T2.course_id
statistics|4
English|2
French|2
data structure|1

-----
SELECT course_id, COUNT(student_id) AS num_students, GROUP_CONCAT(course_name) AS course_names FROM Student_Course_Registrations GROUP BY course_id ORDER BY course_id;

Error: no such column: course_name

==========
==========
student_assessment Find id of candidates whose assessment code is "Pass"?
SELECT candidate_id FROM candidate_assessments WHERE asessment_outcome_code = "Pass"
111
121
141
151

-----
SELECT Candidate_Assessments.id FROM Candidate_Assessments WHERE Candidate_Assessments.assessment_code = "Pass";

Error: no such column: Candidate_Assessments.id

==========
==========
student_assessment What are the ids of the candidates that have an outcome code of Pass?
SELECT candidate_id FROM candidate_assessments WHERE asessment_outcome_code = "Pass"
111
121
141
151

-----
SELECT Candidate_Assessments.Candidate_Id FROM Candidate_Assessments WHERE Candidate_Assessments.Outcome_Code = 'Pass';

Error: no such column: Candidate_Assessments.Outcome_Code

==========
==========